app/controllers/users_controller.rb

INSERT INTO "users" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["avatar_file_name", "2013-07_27.jpg"], ["avatar_file_size", 85997], ["avatar_updated_at", "2014-04-11 03:19:01.775767"], ["updated_at", "2014-04-11 03:19:02.190545"]]
---
  def update

    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update_attributes(user_params)